eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
  // const char* subprotocols[] = {}; // THIS LINE SHOULD BE REMOVED/COMMENTED
  // webSocket.setSubprotocols(subprotocols, 0); // THIS LINE SHOULD BE REMOVED/COMMENTED

  // Set a browser-like User-Agent.
  // The library will send its default Sec-WebSocket-Protocol: arduino.
  // webSocket.setUserAgent("Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.93 Safari/537.36 ESP32WebSocketClient");

  // Connect to WSS (WebSocket Secure) server.
  // For production systems with public CAs (like Let's Encrypt), this should work.
  // If connection issues occur with SSL, you might need to provide a root CA certificate
  // or a fingerprint, e.g., webSocket.beginSSL(wsHost, wsPort, wsPath, "/path_to_ca_cert_on_fs", "fingerprint");
  // However, for many common CAs, the ESP32's underlying stack may handle it.
  webSocket.beginSSL(wsHost, wsPort, wsPath);
  webSocket.onEvent(webSocketEvent);
  webSocket.setReconnectInterval(5000); // Already set via const but can be set here too
  // Optional: for SSL, if your server uses a self-signed cert or you want to pin.
  // webSocket.setFingerprint("...");
}



void saveTimersToPreferences() {
  preferences.begin("servo_config"); // Begin the session here

  preferences.putInt("num_timers", numTimeSlots);
  Serial.printf("Saved num_timers: %d\n", numTimeSlots);
  Serial.printf("Read back num_timers: %d\n", preferences.getInt("num_timers", -99));

  for (int i = 0; i < numTimeSlots; i++) {
    String startKey = "timer_" + String(i) + "_start";
    String stopKey = "timer_" + String(i) + "_stop";

    preferences.putInt(startKey.c_str(), timeSlots[i].startTimeMinutes);
    Serial.printf("Saved %s: %d\n", startKey.c_str(), timeSlots[i].startTimeMinutes);
    Serial.printf("Read back %s: %d\n", startKey.c_str(), preferences.getInt(startKey.c_str(), -99));

    preferences.putInt(stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    Serial.printf("Saved %s: %d\n", stopKey.c_str(), timeSlots[i].stopTimeMinutes);
    Serial.printf("Read back %s: %d\n", stopKey.c_str(), preferences.getInt(stopKey.c_str(), -99));
  }

  preferences.end(); // End the session here
  Serial.println("Timers saved to Preferences and verification read performed.");
}

void addTimeSlot(String startTimeStr, String stopTimeStr) {
  if (numTimeSlots < MAX_TIMERS) {
    int startTimeMinutes = timeToMinutes(startTimeStr);
    int stopTimeMinutes = timeToMinutes(stopTimeStr);
    timeSlots[numTimeSlots].startTimeMinutes = startTimeMinutes;
    timeSlots[numTimeSlots].stopTimeMinutes = stopTimeMinutes;
    numTimeSlots++; // Increment numTimeSlots FIRST
    saveTimersToPreferences(); // Now save with the updated count
  } else {
    Serial.println("Maximum number of timers reached.");
  }
}

void deleteTimeSlot(int indexToDelete) {
  if (indexToDelete >= 0 && indexToDelete < numTimeSlots) {
    // Shift the remaining timers to fill the gap
    for (int i = indexToDelete; i < numTimeSlots - 1; i++) {
      timeSlots[i] = timeSlots[i + 1];
    }
    // Mark the last slot as empty
    timeSlots[numTimeSlots - 1].startTimeMinutes = -1;
    timeSlots[numTimeSlots - 1].stopTimeMinutes = -1;
    numTimeSlots--;
    saveTimersToPreferences();
  } else {
    Serial.println("Invalid timer index to delete.");
  }
}



void updateDisplay() {
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 0);

  if (WiFi.status() == WL_CONNECTED) {
    display.print("IP: ");
    display.println(WiFi.localIP());
    display.print("Time: ");
    display.println(timeClient.getFormattedTime());
    display.setCursor(0, 16); // Move to the second half of the screen

    if (isScheduledMovementActive) {
      display.println("Scheduled movement");
      display.printf("%s - %s", currentScheduleStartTime.c_str(), currentScheduleStopTime.c_str());
    } else if (randomMotionActive) {
      display.println("Random movement");
    } else {
      display.println("Standby");
    }
  } else {
    display.println("WiFi Disconnected");
  }
  display.display();
}

// Function to start a smooth servo movement
/**
 * @brief Initiates a smooth, non-blocking movement for a specified servo.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 * @param targetPos The target position (angle) for the servo.
 * @param moveTime The total duration in milliseconds the movement should take.
 */
void startServoMovement(Servo& servo, ServoMovement &movement, int targetPos, int moveTime) {
  movement.startPos = servo.read();
  movement.targetPos = targetPos;
  movement.startTime = millis();
  movement.duration = moveTime;
  movement.isMoving = true;
}

// Function to update servo position smoothly (non-blocking)
/**
 * @brief Updates the position of a servo during a smooth movement.
 * Call this repeatedly in the loop for each servo that might be moving.
 * @param servo The Servo object to control.
 * @param movement A reference to the ServoMovement struct tracking this servo's state.
 */
void updateServoMovement(Servo& servo, ServoMovement &movement) {
  if (movement.isMoving) {
    unsigned long elapsedTime = millis() - movement.startTime;
    if (elapsedTime >= movement.duration) {
      servo.write(movement.targetPos);  // Final position
      movement.isMoving = false; // Stop the movement
    } else {
      float progress = float(elapsedTime) / movement.duration;
      int currentPos = movement.startPos + (movement.targetPos - movement.startPos) * progress;
      servo.write(int(currentPos));
    }
  }
}
// Function to test servo movement by moving it from min to max and back
void testServo(Servo& servo, int minPos, int maxPos) {
  servo.write(minPos);
  delay(1000);  // Wait for movement to complete
  servo.write(maxPos);
}

/**
 * @brief Manages random, non-blocking movements for both servos.
 *
 * When called, if enough time has passed since the last random move (defined by `movementInterval`),
 * it calculates new random target positions for both servos within their configured min/max ranges.
 * It then calculates a movement duration based on the distance to travel and initiates
 * smooth movements using `startServoMovement()`. A new random `movementInterval` is set for the next cycle.
 */
void moveServosRandomlyNonBlocking() {
    unsigned long currentMillis = millis();

    if (currentMillis - lastMotionTime >= movementInterval) {
      lastMotionTime = currentMillis;

