eben80/KytsaLaserCam/src/esp32devkitv1/main.cpp
        if (settingsMode) {
          Serial.println("Entering settings mode.");
        } else {
          Serial.println("Exiting settings mode.");
        }
      }

      if (touchDuration2 < 500 && !shortTouchProcessed2) {
        shortTouchProcessed2 = true;
        if (!settingsMode) {
          // Toggle Random Motion
          randomMotionActive = !randomMotionActive;
          if (randomMotionActive) {
            Serial.println("Random motion is now active.");
          } else {
            Serial.println("Random motion is now inactive.");
          }
        } else {
          // Adjust Settings (using both buttons)
          if (touchValue1 < threshold) { // If Touch 1 is also pressed (decrement)
            adjustSettings(currentSetting, false); // Decrement
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          } else {  // If only Touch 2 is pressed (increment)
            adjustSettings(currentSetting, true); // Increment
            Serial.print("Adjusting setting "); Serial.println(currentSetting);
          }
          currentSetting = (currentSetting + 1) % 4; // Cycle through 0-3
          Serial.print("Next setting to adjust "); Serial.println(currentSetting);
        }
      }
    }
  } else { // Touch is released!
    touchInProgress2 = false;
    shortTouchProcessed2 = false;
    longTouchProcessed2 = false;  // Reset here!
  }
}

/**
 * @brief Main loop of the ESP32 DevKitV1 application.
 *
 * This function is executed repeatedly and handles the core logic:
 * - Handles ArduinoOTA updates.
 * - Processes WebSocket client events and reconnection logic.
 * - Reads touch pin inputs for sleep/wake and settings adjustment.
 * - Manages scheduled movements based on NTP time and configured time slots.
 * - Controls random servo movements if enabled (either by schedule or manual toggle).
 * - Updates servo positions for smooth, non-blocking movements.
 * - Updates the OLED display based on current mode (normal, settings) and status.
 * - Sends periodic status updates to the WebSocket server.
 * - Handles serial communication with the ESP32CAM (receiving status, sending commands).
 * - Manages WiFi connection using WiFiManager, attempting to reconnect if disconnected.
 * - Forwards commands received via main Serial to the ESP32CAM via Serial2.
 * - Periodically updates NTP time.
 */
void loop() {
  ArduinoOTA.handle();
  webSocket.loop();
  readTouch();

  if (!webSocketConnected && WiFi.status() == WL_CONNECTED) {
    if (millis() - webSocketLastReconnectAttempt > webSocketReconnectInterval) {
      webSocketLastReconnectAttempt = millis();
      Serial.println("Attempting to reconnect WebSocket...");
      // webSocket.begin() should ideally handle reconnection attempts if using setReconnectInterval
      // but an explicit begin call might be needed if the initial connection fails repeatedly.
      // For now, rely on setReconnectInterval and internal handling.
      // If connection drops, the library should try to reconnect.
      // If initial connect fails, this might need an explicit webSocket.connect(host,port,path) or begin again.
      // Let's assume library handles reconnects for now. If not, add explicit webSocket.connect() here.
    }
  }

  bool shouldMoveRandomlyThisCycle = false;
  String scheduledStartTime = ""; // Local variables to store the times
  String scheduledStopTime = "";

  if (timeClient.isTimeSet()) {
    String currentTime = getFormattedTime();
    int currentMinutes = timeToMinutes(currentTime);

    for (int i = 0; i < numTimeSlots; i++) {
      if (timeSlots[i].startTimeMinutes != -1 && timeSlots[i].stopTimeMinutes != -1) {
        if (timeSlots[i].startTimeMinutes < timeSlots[i].stopTimeMinutes) {
          if (currentMinutes >= timeSlots[i].startTimeMinutes && currentMinutes < timeSlots[i].stopTimeMinutes) {
            shouldMoveRandomlyThisCycle = true;
            scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
            scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
            break;
          }
        } else { // Handle cases where the stop time is on the next day (e.g., 22:00 - 02:00)
          if (currentMinutes >= timeSlots[i].startTimeMinutes || currentMinutes < timeSlots[i].stopTimeMinutes) {
            shouldMoveRandomlyThisCycle = true;
            scheduledStartTime = minutesToTime(timeSlots[i].startTimeMinutes);
            scheduledStopTime = minutesToTime(timeSlots[i].stopTimeMinutes);
            break;
          }
        }
      }
    }
  }

  isScheduledMovementActive = shouldMoveRandomlyThisCycle; // Update the global state
  if (isScheduledMovementActive) {
    currentScheduleStartTime = scheduledStartTime; // Update the global start time
    currentScheduleStopTime = scheduledStopTime;   // Update the global stop time
    turnLaserOn();
  } else {
    currentScheduleStartTime = ""; // Clear the global start time when no schedule is active
    currentScheduleStopTime = "";   // Clear the global stop time when no schedule is active
  }

  // Call random movement if the schedule says it should AND it's not overridden, OR if the button is toggled ON
  if ((shouldMoveRandomlyThisCycle && !scheduledMovementOverridden) || randomMotionActive) {
    moveServosRandomlyNonBlocking(); // Call the non-blocking random movement function
    turnLaserOn();
  } else {
    if (!inConfiguration) {  turnLaserOff();}
  }

  updateServoMovement(myservoX, movementX); // Update X servo movement
  updateServoMovement(myservoY, movementY); // Update Y servo movement

  if (settingsMode) {
    displaySettings();
  } else {
    updateDisplay();
  }

  // Status Sending Logic
  static unsigned long lastStatusUpdateTime = 0;
  unsigned long statusUpdateInterval = 10000; // Send status every 10 seconds

  if (webSocketConnected && (millis() - lastStatusUpdateTime > statusUpdateInterval)) {
    lastStatusUpdateTime = millis();
    StaticJsonDocument<512> doc; // Increased size for more status data
    doc["type"] = "statusUpdate";
    // No need to send deviceId, server knows it from connection object

    JsonObject data = doc.createNestedObject("data");
    data["uptime_ms"] = millis();
    data["wifi_rssi"] = WiFi.RSSI();
    data["servoX_pos"] = myservoX.read();
    data["servoY_pos"] = myservoY.read();
    data["laser_active"] = digitalRead(outputPin) == HIGH;
    data["relay_active"] = relayActive;
    data["random_motion_active"] = randomMotionActive;
    data["is_scheduled_movement_active"] = isScheduledMovementActive;
    data["esp32cam_connected"] = esp32CamConnected;
    data["esp32cam_streaming"] = streaming;
    // Add other relevant status data

    String output;
    serializeJson(doc, output);
    webSocket.sendTXT(output);
    Serial.println("Sent status update: " + output);
  }

